Revit 2024 API
RebarCoupler Class
 Represents a rebar coupler element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class RebarCoupler : Element
Visual Basic
Public Class RebarCoupler _
	Inherits Element
Visual C++
public ref class RebarCoupler : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.RebarCoupler
See Also
RebarCoupler Members
Autodesk.Revit.DB.Structure Namespace